cmsis-svd/cmsis-svd/data/SiliconLabs/EFR32BG1P332F256GJ43.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ACMP0</name>
      <version>5.7.0</version>
      <description>ACMP0</description>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ACMP0</name>
        <value>13</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x07000000</resetValue>
          <resetMask>0xBF3CF70D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Analog Comparator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INACTVAL</name>
              <description>Inactive Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOINV</name>
              <description>Comparator GPIO Output Invert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTXMASTERDIS</name>
              <description>APORT Bus X Master Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTYMASTERDIS</name>
              <description>APORT Bus Y Master Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTVMASTERDIS</name>
              <description>APORT Bus Master Disable for Bus Selected By VASEL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRSEL</name>
              <description>Power Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVDD</name>
                  <description>AVDD supply</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVDD</name>
                  <description>DVDD supply</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOVDD0</name>
                  <description>IOVDD/IOVDD0 supply</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOVDD1</name>
                  <description>IOVDD1 supply (if part has two I/O voltages)</description>
                  <value>0x00000004</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCURACY</name>
              <description>ACMP Accuracy Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUTRANGE</name>
              <description>Input Range</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Setting when the input can be from 0 to ACMPVDD.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTVDDDIV2</name>
                  <description>Setting when the input will always be greater than ACMPVDD/2.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LTVDDDIV2</name>
                  <description>Setting when the input will always be less than ACMPVDD/2.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRISE</name>
              <description>Rising Edge Interrupt Sense</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFALL</name>
              <description>Falling Edge Interrupt Sense</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIASPROG</name>
              <description>Bias Configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FULLBIAS</name>
              <description>Full Bias Current</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUTSEL</name>
          <description>Input Selection Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x757FFFFF</resetMask>
          <fields>
            <field>
              <name>POSSEL</name>
              <description>Positive Input Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEGSEL</name>
              <description>Negative Input Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VASEL</name>
              <description>VA Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>ACMPVDD</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH0</name>
                  <description>APORT2Y Channel 0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH2</name>
                  <description>APORT2Y Channel 2</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH4</name>
                  <description>APORT2Y Channel 4</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH6</name>
                  <description>APORT2Y Channel 6</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH8</name>
                  <description>APORT2Y Channel 8</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH10</name>
                  <description>APORT2Y Channel 10</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH12</name>
                  <description>APORT2Y Channel 12</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH14</name>
                  <description>APORT2Y Channel 14</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH16</name>
                  <description>APORT2Y Channel 16</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH18</name>
                  <description>APORT2Y Channel 18</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH20</name>
                  <description>APORT2Y Channel 20</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH22</name>
                  <description>APORT2Y Channel 22</description>
                  <value>0x00000017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH24</name>
                  <description>APORT2Y Channel 24</description>
                  <value>0x00000019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH26</name>
                  <description>APORT2Y Channel 26</description>
                  <value>0x0000001B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH28</name>
                  <description>APORT2Y Channel 28</description>
                  <value>0x0000001D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT2YCH30</name>
                  <description>APORT2Y Channel 30</description>
                  <value>0x0000001F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH0</name>
                  <description>APORT1X Channel 0</description>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH1</name>
                  <description>APORT1Y Channel 1</description>
                  <value>0x00000021</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH2</name>
                  <description>APORT1X Channel 2</description>
                  <value>0x00000022</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH3</name>
                  <description>APORT1Y Channel 3</description>
                  <value>0x00000023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH4</name>
                  <description>APORT1X Channel 4</description>
                  <value>0x00000024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH5</name>
                  <description>APORT1Y Channel 5</description>
                  <value>0x00000025</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH6</name>
                  <description>APORT1X Channel 6</description>
                  <value>0x00000026</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH7</name>
                  <description>APORT1Y Channel 7</description>
                  <value>0x00000027</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH8</name>
                  <description>APORT1X Channel 8</description>
                  <value>0x00000028</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH9</name>
                  <description>APORT1Y Channel 9</description>
                  <value>0x00000029</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH10</name>
                  <description>APORT1X Channel 10</description>
                  <value>0x0000002A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH11</name>
                  <description>APORT1Y Channel 11</description>
                  <value>0x0000002B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH12</name>
                  <description>APORT1X Channel 12</description>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH13</name>
                  <description>APORT1Y Channel 13</description>
                  <value>0x0000002D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH14</name>
                  <description>APORT1X Channel 14</description>
                  <value>0x0000002E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH15</name>
                  <description>APORT1Y Channel 15</description>
                  <value>0x0000002F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH16</name>
                  <description>APORT1X Channel 16</description>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH17</name>
                  <description>APORT1Y Channel 17</description>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH18</name>
                  <description>APORT1X Channel 18</description>
                  <value>0x00000032</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH19</name>
                  <description>APORT1Y Channel 19</description>
                  <value>0x00000033</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH20</name>
                  <description>APORT1X Channel 20</description>
                  <value>0x00000034</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH21</name>
                  <description>APORT1Y Channel 21</description>
                  <value>0x00000035</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH22</name>
                  <description>APORT1X Channel 22</description>
                  <value>0x00000036</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH23</name>
                  <description>APORT1Y Channel 23</description>
                  <value>0x00000037</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH24</name>
                  <description>APORT1X Channel 24</description>
                  <value>0x00000038</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH25</name>
                  <description>APORT1Y Channel 25</description>
                  <value>0x00000039</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH26</name>
                  <description>APORT1X Channel 26</description>
                  <value>0x0000003A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH27</name>
                  <description>APORT1Y Channel 27</description>
                  <value>0x0000003B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH28</name>
                  <description>APORT1X Channel 28</description>
                  <value>0x0000003C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH29</name>
                  <description>APORT1Y Channel 29</description>
                  <value>0x0000003D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH30</name>
                  <description>APORT1X Channel 30</description>
                  <value>0x0000003E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH31</name>
                  <description>APORT1Y Channel 31</description>
                  <value>0x0000003F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBSEL</name>
              <description>VB Selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLPSEL</name>
              <description>Low-Power Sampled Voltage Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSRESEN</name>
              <description>Capacitive Sense Mode Internal Resistor Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSRESSEL</name>
              <description>Capacitive Sense Mode Internal Resistor Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0</name>
                  <description>Internal capacitive sense resistor value 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1</name>
                  <description>Internal capacitive sense resistor value 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2</name>
                  <description>Internal capacitive sense resistor value 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3</name>
                  <description>Internal capacitive sense resistor value 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES4</name>
                  <description>Internal capacitive sense resistor value 4</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES5</name>
                  <description>Internal capacitive sense resistor value 5</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES6</name>
                  <description>Internal capacitive sense resistor value 6</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES7</name>
                  <description>Internal capacitive sense resistor value 7</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>ACMPACT</name>
              <description>Analog Comparator Active</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACMPOUT</name>
              <description>Analog Comparator Output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>APORT Conflict Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flag Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>EDGE</name>
              <description>Edge Triggered Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WARMUP</name>
              <description>Warm-up Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>APORT Conflict Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
